TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_eventmanager.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_eventmanager__include
#define ti_devices_msp_peripherals_hw_eventmanager__include

/* Filename: hw_eventmanager.h */
/* Revised: 2025-04-09 13:57:08 */
/* Revision: f4602b816b1643a266cc7aae6be755d35f394359 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* EVENTMANAGER Registers
******************************************************************************/
#define EVENTMANAGER_IMPEXPCFG_IMPORT_OFS        ((uint32_t)0x00002200U)
#define EVENTMANAGER_IMPEXPCFG_EXPORT_OFS        ((uint32_t)0x00002000U)
#define EVENTMANAGER_IMPEXPCFG_OFS               ((uint32_t)0x00002000U)
#define EVENTMANAGER_SECCFG_CPU_CONNECT_OFS      ((uint32_t)0x00001300U)
#define EVENTMANAGER_SECCFG_IMPORT_OFS           ((uint32_t)0x00001280U)
#define EVENTMANAGER_SECCFG_EXPORT_OFS           ((uint32_t)0x00001200U)
#define EVENTMANAGER_SECCFG_FPUB_OFS             ((uint32_t)0x00001180U)
#define EVENTMANAGER_SECCFG_FSUB_OFS             ((uint32_t)0x00001100U)
#define EVENTMANAGER_SECCFG_OFS                  ((uint32_t)0x00001000U)
#define EVENTMANAGER_PUBCFG_CPU_CONNECT_OFS      ((uint32_t)0x00000900U)
#define EVENTMANAGER_PUBCFG_IMPORT_OFS           ((uint32_t)0x00000700U)
#define EVENTMANAGER_PUBCFG_EXPORT_OFS           ((uint32_t)0x00000500U)
#define EVENTMANAGER_PUBCFG_FPUB_OFS             ((uint32_t)0x00000300U)
#define EVENTMANAGER_PUBCFG_FSUB_OFS             ((uint32_t)0x00000100U)
#define EVENTMANAGER_PUBCFG_OFS                  ((uint32_t)0x00000000U)


/** @addtogroup EVENTMANAGER_IMPEXPCFG_IMPORT
  @{
*/

typedef struct {
  __IO uint32_t PORT;                              /* !< (@ 0x00002200) Import channel ID registe */
} EVENTMANAGER_IMPEXPCFG_IMPORT_Regs;

/*@}*/ /* end of group EVENTMANAGER_IMPEXPCFG_IMPORT */

/** @addtogroup EVENTMANAGER_IMPEXPCFG_EXPORT
  @{
*/

typedef struct {
  __IO uint32_t PORT;                              /* !< (@ 0x00002000) Export channel ID register */
} EVENTMANAGER_IMPEXPCFG_EXPORT_Regs;

/*@}*/ /* end of group EVENTMANAGER_IMPEXPCFG_EXPORT */

/** @addtogroup EVENTMANAGER_IMPEXPCFG
  @{
*/

typedef struct {
  EVENTMANAGER_IMPEXPCFG_EXPORT_Regs  EXPORT[128];                       /* !< (@ 0x00002000) */
  EVENTMANAGER_IMPEXPCFG_IMPORT_Regs  IMPORT[128];                       /* !< (@ 0x00002200) */
} EVENTMANAGER_IMPEXPCFG_Regs;

/*@}*/ /* end of group EVENTMANAGER_IMPEXPCFG */

/** @addtogroup EVENTMANAGER_SECCFG_CPU_CONNECT
  @{
*/

typedef struct {
  __IO uint8_t CPU_NUM[256];                      /* !< (@ 0x00001300) CPU connect register */
} EVENTMANAGER_SECCFG_CPU_CONNECT_Regs;

/*@}*/ /* end of group EVENTMANAGER_SECCFG_CPU_CONNECT */

/** @addtogroup EVENTMANAGER_SECCFG_IMPORT
  @{
*/

typedef struct {
  __IO uint8_t PORT[128];                         /* !< (@ 0x00001280) Import channel ID registe */
} EVENTMANAGER_SECCFG_IMPORT_Regs;

/*@}*/ /* end of group EVENTMANAGER_SECCFG_IMPORT */

/** @addtogroup EVENTMANAGER_SECCFG_EXPORT
  @{
*/

typedef struct {
  __IO uint8_t PORT[128];                         /* !< (@ 0x00001200) Export channel ID register */
} EVENTMANAGER_SECCFG_EXPORT_Regs;

/*@}*/ /* end of group EVENTMANAGER_SECCFG_EXPORT */

/** @addtogroup EVENTMANAGER_SECCFG_FPUB
  @{
*/

typedef struct {
  __IO uint8_t PORT[128];                         /* !< (@ 0x00001180) Publisher channel ID register */
} EVENTMANAGER_SECCFG_FPUB_Regs;

/*@}*/ /* end of group EVENTMANAGER_SECCFG_FPUB */

