TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_eventmanager.h
/** @addtogroup EVENTMANAGER_SECCFG_FSUB
  @{
*/

typedef struct {
  __IO uint8_t PORT[128];                         /* !< (@ 0x00001100) Subscriber channel ID register */
} EVENTMANAGER_SECCFG_FSUB_Regs;

/*@}*/ /* end of group EVENTMANAGER_SECCFG_FSUB */

/** @addtogroup EVENTMANAGER_SECCFG
  @{
*/

typedef struct {
       uint32_t RESERVED0[62];
  __I  uint32_t DESC_EX;                           /* !< (@ 0x000010F8) Extended Module Description */
  __I  uint32_t DESC;                              /* !< (@ 0x000010FC) Module Description */
  EVENTMANAGER_SECCFG_FSUB_Regs  FSUB;                              /* !< (@ 0x00001100) */
  EVENTMANAGER_SECCFG_FPUB_Regs  FPUB;                              /* !< (@ 0x00001180) */
  EVENTMANAGER_SECCFG_EXPORT_Regs  EXPORT;                            /* !< (@ 0x00001200) */
  EVENTMANAGER_SECCFG_IMPORT_Regs  IMPORT;                            /* !< (@ 0x00001280) */
  EVENTMANAGER_SECCFG_CPU_CONNECT_Regs  CPU_CONNECT;                       /* !< (@ 0x00001300) */
  __IO uint8_t CTL;                               /* !< (@ 0x00001400) Event Manager control register */
} EVENTMANAGER_SECCFG_Regs;

/*@}*/ /* end of group EVENTMANAGER_SECCFG */

/** @addtogroup EVENTMANAGER_PUBCFG_CPU_CONNECT
  @{
*/

typedef struct {
  __IO uint32_t CPU_NUM[256];                      /* !< (@ 0x00000900) CPU connect register */
} EVENTMANAGER_PUBCFG_CPU_CONNECT_Regs;

/*@}*/ /* end of group EVENTMANAGER_PUBCFG_CPU_CONNECT */

/** @addtogroup EVENTMANAGER_PUBCFG_IMPORT
  @{
*/

typedef struct {
  __IO uint32_t PORT[128];                         /* !< (@ 0x00000700) Import channel ID registe */
} EVENTMANAGER_PUBCFG_IMPORT_Regs;

/*@}*/ /* end of group EVENTMANAGER_PUBCFG_IMPORT */

/** @addtogroup EVENTMANAGER_PUBCFG_EXPORT
  @{
*/

typedef struct {
  __IO uint32_t PORT[128];                         /* !< (@ 0x00000500) Export channel ID register */
} EVENTMANAGER_PUBCFG_EXPORT_Regs;

/*@}*/ /* end of group EVENTMANAGER_PUBCFG_EXPORT */

/** @addtogroup EVENTMANAGER_PUBCFG_FPUB
  @{
*/

typedef struct {
  __IO uint32_t PORT[128];                         /* !< (@ 0x00000300) Publisher channel ID register */
} EVENTMANAGER_PUBCFG_FPUB_Regs;

/*@}*/ /* end of group EVENTMANAGER_PUBCFG_FPUB */

/** @addtogroup EVENTMANAGER_PUBCFG_FSUB
  @{
*/

typedef struct {
  __IO uint32_t PORT[128];                         /* !< (@ 0x00000100) Subscriber channel ID register */
} EVENTMANAGER_PUBCFG_FSUB_Regs;

/*@}*/ /* end of group EVENTMANAGER_PUBCFG_FSUB */

/** @addtogroup EVENTMANAGER_PUBCFG
  @{
*/

typedef struct {
       uint32_t RESERVED0[62];
  __I  uint32_t DESC_EX;                           /* !< (@ 0x000000F8) Extended Module Description */
  __I  uint32_t DESC;                              /* !< (@ 0x000000FC) Module Description */
  EVENTMANAGER_PUBCFG_FSUB_Regs  FSUB;                              /* !< (@ 0x00000100) */
  EVENTMANAGER_PUBCFG_FPUB_Regs  FPUB;                              /* !< (@ 0x00000300) */
  EVENTMANAGER_PUBCFG_EXPORT_Regs  EXPORT;                            /* !< (@ 0x00000500) */
  EVENTMANAGER_PUBCFG_IMPORT_Regs  IMPORT;                            /* !< (@ 0x00000700) */
  EVENTMANAGER_PUBCFG_CPU_CONNECT_Regs  CPU_CONNECT;                       /* !< (@ 0x00000900) */
} EVENTMANAGER_PUBCFG_Regs;

/*@}*/ /* end of group EVENTMANAGER_PUBCFG */

/** @addtogroup EVENTMANAGER
  @{
*/

typedef struct {
  EVENTMANAGER_PUBCFG_Regs  PUBCFG;                            /* !< (@ 0x00000000) */
       uint32_t RESERVED0[192];
  EVENTMANAGER_SECCFG_Regs  SECCFG;                            /* !< (@ 0x00001000) */
       uint8_t  RESERVED1[3071];
  EVENTMANAGER_IMPEXPCFG_Regs  IMPEXPCFG;                         /* !< (@ 0x00002000) */
} EVENTMANAGER_Regs;

/*@}*/ /* end of group EVENTMANAGER */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* EVENTMANAGER Register Control Bits
******************************************************************************/

/* EVENTMANAGER_IMPEXPCFG_IMPORT_PORT Bits */
/* EVENTMANAGER_IMPEXPCFG_IMPORT_PORT[CHANID] Bits */
#define EVENTMANAGER_IMPEXPCFG_IMPORT_PORT_CHANID_OFS (0)                             /* !< CHANID Offset */
#define EVENTMANAGER_IMPEXPCFG_IMPORT_PORT_CHANID_MASK ((uint32_t)0x000000FFU)         /* !< Channel ID for import side to
                                                                                    connect to */
#define EVENTMANAGER_IMPEXPCFG_IMPORT_PORT_CHANID_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTMANAGER_IMPEXPCFG_IMPORT_PORT_CHANID_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTMANAGER_IMPEXPCFG_EXPORT_PORT Bits */
/* EVENTMANAGER_IMPEXPCFG_EXPORT_PORT[CHANID] Bits */
#define EVENTMANAGER_IMPEXPCFG_EXPORT_PORT_CHANID_OFS (0)                             /* !< CHANID Offset */
#define EVENTMANAGER_IMPEXPCFG_EXPORT_PORT_CHANID_MASK ((uint32_t)0x000000FFU)         /* !< Channel ID for import side to
                                                                                    connect to */
#define EVENTMANAGER_IMPEXPCFG_EXPORT_PORT_CHANID_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTMANAGER_IMPEXPCFG_EXPORT_PORT_CHANID_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTMANAGER_SECCFG_CPU_NUM Bits */
/* EVENTMANAGER_SECCFG_CPU_NUM[NWPW_CONN] Bits */
#define EVENTMANAGER_SECCFG_CPU_NUM_NWPW_CONN_OFS (0)                             /* !< NWPW_CONN Offset */
#define EVENTMANAGER_SECCFG_CPU_NUM_NWPW_CONN_MASK ((uint8_t)0x00000001U)          /* !< NWPW connect bit. */
#define EVENTMANAGER_SECCFG_CPU_NUM_NWPW_CONN_UNCONNECTED ((uint8_t)0x00000000U)          /* !< The CPU is not connected. */
#define EVENTMANAGER_SECCFG_CPU_NUM_NWPW_CONN_CONNECTED ((uint8_t)0x00000001U)          /* !< The CPU is connected. */
/* EVENTMANAGER_SECCFG_CPU_NUM[CPUSS0_CONN] Bits */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS0_CONN_OFS (1)                             /* !< CPUSS0_CONN Offset */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS0_CONN_MASK ((uint8_t)0x00000002U)          /* !< CPUSS0 connect bit. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS0_CONN_UNCONNECTED ((uint8_t)0x00000000U)          /* !< The CPU is not connected. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS0_CONN_CONNECTED ((uint8_t)0x00000002U)          /* !< The CPU is connected. */
/* EVENTMANAGER_SECCFG_CPU_NUM[CPUSS1_CONN] Bits */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS1_CONN_OFS (2)                             /* !< CPUSS1_CONN Offset */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS1_CONN_MASK ((uint8_t)0x00000004U)          /* !< CPUSS1 connect bit. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS1_CONN_UNCONNECTED ((uint8_t)0x00000000U)          /* !< The CPU is not connected. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS1_CONN_CONNECTED ((uint8_t)0x00000004U)          /* !< The CPU is connected. */
/* EVENTMANAGER_SECCFG_CPU_NUM[CPUSS2_CONN] Bits */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS2_CONN_OFS (3)                             /* !< CPUSS2_CONN Offset */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS2_CONN_MASK ((uint8_t)0x00000008U)          /* !< CPUSS2 connect bit. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS2_CONN_UNCONNECTED ((uint8_t)0x00000000U)          /* !< The CPU is not connected. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS2_CONN_CONNECTED ((uint8_t)0x00000008U)          /* !< The CPU is connected. */
/* EVENTMANAGER_SECCFG_CPU_NUM[CPUSS3_CONN] Bits */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS3_CONN_OFS (4)                             /* !< CPUSS3_CONN Offset */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS3_CONN_MASK ((uint8_t)0x00000010U)          /* !< CPUSS3 connect bit. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS3_CONN_UNCONNECTED ((uint8_t)0x00000000U)          /* !< The CPU is not connected. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS3_CONN_CONNECTED ((uint8_t)0x00000010U)          /* !< The CPU is connected. */
/* EVENTMANAGER_SECCFG_CPU_NUM[CPUSS4_CONN] Bits */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS4_CONN_OFS (5)                             /* !< CPUSS4_CONN Offset */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS4_CONN_MASK ((uint8_t)0x00000020U)          /* !< CPUSS4 connect bit. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS4_CONN_UNCONNECTED ((uint8_t)0x00000000U)          /* !< The CPU is not connected. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS4_CONN_CONNECTED ((uint8_t)0x00000020U)          /* !< The CPU is connected. */
/* EVENTMANAGER_SECCFG_CPU_NUM[CPUSS5_CONN] Bits */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS5_CONN_OFS (6)                             /* !< CPUSS5_CONN Offset */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS5_CONN_MASK ((uint8_t)0x00000040U)          /* !< CPUSS5 connect bit. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS5_CONN_UNCONNECTED ((uint8_t)0x00000000U)          /* !< The CPU is not connected. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS5_CONN_CONNECTED ((uint8_t)0x00000040U)          /* !< The CPU is connected. */
/* EVENTMANAGER_SECCFG_CPU_NUM[CPUSS6_CONN] Bits */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS6_CONN_OFS (7)                             /* !< CPUSS6_CONN Offset */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS6_CONN_MASK ((uint8_t)0x00000080U)          /* !< CPUSS6 connect bit. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS6_CONN_UNCONNECTED ((uint8_t)0x00000000U)          /* !< The CPU is not connected. */
#define EVENTMANAGER_SECCFG_CPU_NUM_CPUSS6_CONN_CONNECTED ((uint8_t)0x00000080U)          /* !< The CPU is connected. */

/* EVENTMANAGER_SECCFG_IMPORT_PORT Bits */
/* EVENTMANAGER_SECCFG_IMPORT_PORT[CHANID] Bits */
#define EVENTMANAGER_SECCFG_IMPORT_PORT_CHANID_OFS (0)                             /* !< CHANID Offset */
#define EVENTMANAGER_SECCFG_IMPORT_PORT_CHANID_MASK ((uint8_t)0x000000FFU)          /* !< Channel ID for import side to
                                                                                    connect to */
#define EVENTMANAGER_SECCFG_IMPORT_PORT_CHANID_MINIMUM ((uint8_t)0x00000000U)          /* !< Minimum value -- 0 has no effect */
#define EVENTMANAGER_SECCFG_IMPORT_PORT_CHANID_MAXIMUM ((uint8_t)0x000000FFU)          /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTMANAGER_SECCFG_EXPORT_PORT Bits */
/* EVENTMANAGER_SECCFG_EXPORT_PORT[CHANID] Bits */
#define EVENTMANAGER_SECCFG_EXPORT_PORT_CHANID_OFS (0)                             /* !< CHANID Offset */
#define EVENTMANAGER_SECCFG_EXPORT_PORT_CHANID_MASK ((uint8_t)0x000000FFU)          /* !< Channel ID for export side to
                                                                                    connect to */
#define EVENTMANAGER_SECCFG_EXPORT_PORT_CHANID_MINIMUM ((uint8_t)0x00000000U)          /* !< Minimum value -- 0 has no effect */
#define EVENTMANAGER_SECCFG_EXPORT_PORT_CHANID_MAXIMUM ((uint8_t)0x000000FFU)          /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

