TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_eventmanager.h
/* EVENTMANAGER_CTL Bits */
/* EVENTMANAGER_CTL[OVRWR_EN] Bits */
#define EVENTMANAGER_CTL_OVRWR_EN_OFS            (0)                             /* !< OVRWR_EN Offset */
#define EVENTMANAGER_CTL_OVRWR_EN_MASK           ((uint8_t)0x0000000FU)          /* !< Enable overwrite of config even if
                                                                                    resources are already configured. By
                                                                                    default, a configuration cannot be
                                                                                    overwritten. */
#define EVENTMANAGER_CTL_OVRWR_EN_DISABLE        ((uint8_t)0x00000005U)          /* !< Overwrite is disabled. Mode is same
                                                                                    as in UNASG aperture. */
#define EVENTMANAGER_CTL_OVRWR_EN_ENABLED        ((uint8_t)0x0000000AU)          /* !< Ovewrite is enabled */

/* EVENTMANAGER_PUBCFG_CPU_NUM Bits */
/* EVENTMANAGER_PUBCFG_CPU_NUM[NWPW_CONN] Bits */
#define EVENTMANAGER_PUBCFG_CPU_NUM_NWPW_CONN_OFS (0)                             /* !< NWPW_CONN Offset */
#define EVENTMANAGER_PUBCFG_CPU_NUM_NWPW_CONN_MASK ((uint32_t)0x00000001U)         /* !< NWPW connect bit. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_NWPW_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_NWPW_CONN_CONNECTED ((uint32_t)0x00000001U)         /* !< The CPU is connected. */
/* EVENTMANAGER_PUBCFG_CPU_NUM[CPUSS0_CONN] Bits */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS0_CONN_OFS (1)                             /* !< CPUSS0_CONN Offset */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS0_CONN_MASK ((uint32_t)0x00000002U)         /* !< CPUSS0 connect bit. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS0_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS0_CONN_CONNECTED ((uint32_t)0x00000002U)         /* !< The CPU is connected. */
/* EVENTMANAGER_PUBCFG_CPU_NUM[CPUSS1_CONN] Bits */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS1_CONN_OFS (2)                             /* !< CPUSS1_CONN Offset */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS1_CONN_MASK ((uint32_t)0x00000004U)         /* !< CPUSS1 connect bit. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS1_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS1_CONN_CONNECTED ((uint32_t)0x00000004U)         /* !< The CPU is connected. */
/* EVENTMANAGER_PUBCFG_CPU_NUM[CPUSS2_CONN] Bits */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS2_CONN_OFS (3)                             /* !< CPUSS2_CONN Offset */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS2_CONN_MASK ((uint32_t)0x00000008U)         /* !< CPUSS2 connect bit. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS2_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS2_CONN_CONNECTED ((uint32_t)0x00000008U)         /* !< The CPU is connected. */
/* EVENTMANAGER_PUBCFG_CPU_NUM[CPUSS3_CONN] Bits */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS3_CONN_OFS (4)                             /* !< CPUSS3_CONN Offset */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS3_CONN_MASK ((uint32_t)0x00000010U)         /* !< CPUSS3 connect bit. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS3_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS3_CONN_CONNECTED ((uint32_t)0x00000010U)         /* !< The CPU is connected. */
/* EVENTMANAGER_PUBCFG_CPU_NUM[CPUSS4_CONN] Bits */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS4_CONN_OFS (5)                             /* !< CPUSS4_CONN Offset */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS4_CONN_MASK ((uint32_t)0x00000020U)         /* !< CPUSS4 connect bit. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS4_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS4_CONN_CONNECTED ((uint32_t)0x00000020U)         /* !< The CPU is connected. */
/* EVENTMANAGER_PUBCFG_CPU_NUM[CPUSS5_CONN] Bits */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS5_CONN_OFS (6)                             /* !< CPUSS5_CONN Offset */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS5_CONN_MASK ((uint32_t)0x00000040U)         /* !< CPUSS5 connect bit. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS5_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS5_CONN_CONNECTED ((uint32_t)0x00000040U)         /* !< The CPU is connected. */
/* EVENTMANAGER_PUBCFG_CPU_NUM[CPUSS6_CONN] Bits */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS6_CONN_OFS (7)                             /* !< CPUSS6_CONN Offset */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS6_CONN_MASK ((uint32_t)0x00000080U)         /* !< CPUSS6 connect bit. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS6_CONN_UNCONNECTED ((uint32_t)0x00000000U)         /* !< The CPU is not connected. */
#define EVENTMANAGER_PUBCFG_CPU_NUM_CPUSS6_CONN_CONNECTED ((uint32_t)0x00000080U)         /* !< The CPU is connected. */

/* EVENTMANAGER_PUBCFG_IMPORT_PORT Bits */
/* EVENTMANAGER_PUBCFG_IMPORT_PORT[CHANID] Bits */
#define EVENTMANAGER_PUBCFG_IMPORT_PORT_CHANID_OFS (0)                             /* !< CHANID Offset */
#define EVENTMANAGER_PUBCFG_IMPORT_PORT_CHANID_MASK ((uint32_t)0x000000FFU)         /* !< Channel ID for import side to
                                                                                    connect to */
#define EVENTMANAGER_PUBCFG_IMPORT_PORT_CHANID_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTMANAGER_PUBCFG_IMPORT_PORT_CHANID_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

/* EVENTMANAGER_PUBCFG_EXPORT_PORT Bits */
/* EVENTMANAGER_PUBCFG_EXPORT_PORT[CHANID] Bits */
#define EVENTMANAGER_PUBCFG_EXPORT_PORT_CHANID_OFS (0)                             /* !< CHANID Offset */
#define EVENTMANAGER_PUBCFG_EXPORT_PORT_CHANID_MASK ((uint32_t)0x000000FFU)         /* !< Channel ID for export side to
                                                                                    connect to */
#define EVENTMANAGER_PUBCFG_EXPORT_PORT_CHANID_MINIMUM ((uint32_t)0x00000000U)         /* !< Minimum value -- 0 has no effect */
#define EVENTMANAGER_PUBCFG_EXPORT_PORT_CHANID_MAXIMUM ((uint32_t)0x000000FFU)         /* !< Maximum value -- check your device
                                                                                    datasheet for actual maximum */

